In [40]:
import pandas as pd
import random as rd
import numpy as np

In [2]:
df = pd.read_excel('score.xlsx',index_col='지원번호')

In [ ]:
# 컬럼 전체 수정
df['요일'] = 0

In [ ]:
# 특정셀 부분 수정
df.loc['1번', '요일'] = 5
df.iloc[1, 9] = 2
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기  요일
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python   5
2번    강태원   구로고  184   40   35   50  55  25        Java   2
3번    강호림   구로고  168   80   75   70  80  75  Javascript   0
4번    김수찬   구로고  187   40   60   70  75  80         NaN   0
5번    김재욱   구로고  188   15   20   10  35  10         NaN   0
6번    박동현  디지털고  202   80  100   95  85  80           C   0
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON   0
8번    승근열  디지털고  190  100   85   90  95  95          C#   0

In [ ]:
# 랜덤으로 0~6까지 숫자 입력
for i in range(df.shape[0]):
  df.iloc[i, 9] = rd.randrange(0, 7)
  # df.iloc[i, 9] = rd.randint(0, 6)
df

       이름    학교    키   국어   영어   수학  과학  사회        SW특기  요일
지원번호
1번    강나래   구로고  197   90   85  100  95  85      Python   4
2번    강태원   구로고  184   40   35   50  55  25        Java   4
3번    강호림   구로고  168   80   75   70  80  75  Javascript   3
4번    김수찬   구로고  187   40   60   70  75  80         NaN   6
5번    김재욱   구로고  188   15   20   10  35  10         NaN   1
6번    박동현  디지털고  202   80  100   95  85  80           C   2
7번    박혜정  디지털고  188   55   65   45  40  35      PYTHON   1
8번    승근열  디지털고  190  100   85   90  95  95          C#   4

In [12]:
# 함수
def func(x):
  days = ['일요일', '월요일', '화요일', '수요일', '목요일', '금요일', '토요일']
  return days[x]

In [13]:
df['요일'] = df['요일'].apply(func)

In [15]:
df['결과'] = '불합격'

In [18]:
# 국어점수가 60점 이상이면 합격으로 수정하세요.
filt = (df['국어'] >= 60)
df.loc[filt, '결과'] = '합격'

In [20]:
# 학교이름에 + 등학교
# 키 + 'cm' 표시
df['키'] = df['키'].astype(str) + 'cm'

In [27]:
df.groupby('학교')['이름'].count()
df.groupby('학교')['이름'].sum()

학교
구로고     강나래강태원강호림김수찬김재욱
디지털고          박동현박혜정승근열
Name: 이름, dtype: object

* 컬럼이 숫자가 아니면 실행이 안된다.
* mean(), max(), min(), std()

In [28]:
df.groupby('학교')['국어'].mean()
df.groupby('학교')['국어'].count()
df.groupby('학교')['국어'].sum().sort_values()
df.groupby('학교')['국어'].sum().sort_values(ascending=False)

학교
구로고     265
디지털고    235
Name: 국어, dtype: int64

In [30]:
df['학년'] = [3, 3, 2, 1, 1, 3, 2, 2]

In [31]:
df.groupby(['학교', '학년'])['국어'].agg(['mean', 'min', 'max', 'sum'])

         mean  min  max  sum
학교   학년
구로고  1   27.5   15   40   55
     2   80.0   80   80   80
     3   65.0   40   90  130
디지털고 2   77.5   55  100  155
     3   80.0   80   80   80

In [35]:
df = pd.read_csv('chipotle.tsv',sep="\t")
df.shape

(4622, 5)

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [69]:
df = pd.read_csv('drinks.csv')
df.shape

(193, 6)

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 7 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
 6   total_servings                193 non-null    int64
dtypes: float64(1), int64(4), object(2)
memory usage: 10.7+ KB

In [71]:
# 술 합계
# 모든 술의 총량을 출력하세요. beer + spirit + wine
# total_servings / 전체 알코올 도수를 확인
df['total_servings'] = df['beer_servings'] + df['spirit_servings'] + df['wine_servings']

In [76]:
# 대륙별 total_servings를 구하세요.
df['continent'].unique()
df.groupby('continent')['total_servings'].sum().sort_values(ascending=False)

continent
EU    21085
OT     7721
AF     4986
AS     4706
SA     4227
OC     2940
Name: total_servings, dtype: int64

In [78]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'total_servings'],
      dtype='object')

In [89]:
# 술 소비량 대비 알코올 비율이 어느정도 되는지 출력하세요.
# 알코올 비율을 계산해서 alcohol_rate 컬럼을 추가하세요.
# total_litres_of_pure_alcohol 알코올 비율을 total_servings으로 나눈 것
# 술소비량 대비 알콜 비율이 높은 나라별 20개를 출력하세요.

# df['alcohol_rate'] = df['total_litres_of_pure_alcohol'] / df['total_servings']
df['alcohol_rate'].value_counts(ascending=False)
df[['country', 'alcohol_rate']].sort_values('alcohol_rate')

# 대륙별 알콜비율도 계산하여 출력하세요.

        country  alcohol_rate
116     Myanmar      0.016667
123       Niger      0.016667
78    Indonesia      0.016667
80         Iraq      0.016667
190       Yemen      0.016667
..          ...           ...
107  Mauritania           NaN
111      Monaco           NaN
128    Pakistan           NaN
147  San Marino           NaN
158     Somalia           NaN

[193 rows x 2 columns]

In [90]:
filt = df['country'].str.lower().str.contains('kor')
df[filt][['country', 'alcohol_rate']]

         country  alcohol_rate
46   North Korea           NaN
138  South Korea      0.059394

In [73]:
filt = df['continent'].isnull()
df.loc[filt, 'total_servings'].sum()

np.int64(7721)

In [74]:
# df['continent'] = df['continent'].fillna('OT')
df['continent'].fillna('OT', inplace=True)

C:\Users\KOSMO\AppData\Local\Temp\ipykernel_14880\4255171080.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['continent'].fillna('OT', inplace=True)

In [75]:
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,total_servings
0,Afghanistan,0,0,0,0.0,AS,0
1,Albania,89,132,54,4.9,EU,275
2,Algeria,25,0,14,0.7,AF,39
3,Andorra,245,138,312,12.4,EU,695
4,Angola,217,57,45,5.9,AF,319
...,...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA,436
189,Vietnam,111,2,1,2.0,AS,114
190,Yemen,6,0,0,0.1,AS,6
191,Zambia,32,19,4,2.5,AF,55
192,Zimbabwe,64,18,4,4.7,AF,86